In [5]:
pip install pandas

Requirement already satisfied: pandas in c:\users\admin\anaconda3\envs\nandhu\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\admin\anaconda3\envs\nandhu\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.20.3 in c:\users\admin\anaconda3\envs\nandhu\lib\site-packages (from pandas) (1.24.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\anaconda3\envs\nandhu\lib\site-packages (from pandas) (2022.7.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\envs\nandhu\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
import pandas as pd  #to create a dataframe

In [14]:

a1=pd.Series(['nandy','mady','nihish','jega'],index=[0,1,2,3])

In [15]:
a1

0     nandy
1      mady
2    nihish
3      jega
dtype: object

In [20]:
season={"winter":{1:'nov',2:'dec',3:'jan',4:'feb'},"dry":{1:'mar',2:'apr',3:'may',4:'jun'}}

In [21]:
season

{'winter': {1: 'nov', 2: 'dec', 3: 'jan', 4: 'feb'},
 'dry': {1: 'mar', 2: 'apr', 3: 'may', 4: 'jun'}}

In [22]:

d=pd.DataFrame(season,columns=["winter","dry"])

In [23]:
d

  winter  dry
1    nov  mar
2    dec  apr
3    jan  may
4    feb  jun

In [24]:
import numpy as np

In [29]:
a=pd.DataFrame(np.random.randint(10,400,size=(20,5)),columns=list('abcde'))

In [30]:
print(a)

      a    b    c    d    e
0   150   83  273  172  198
1    52   25  259  390  308
2    81   89  123   10  275
3   386  291   81  309  254
4   369   72  179   10  260
5   354  140   51  383  324
6    78  305  117   63  251
7   304  368  385  239  255
8   287   39  332  317   81
9   175  165  357  137  357
10  227   39  138  237  282
11   77  392  368  237   12
12  354   57  336  271  248
13  139  349  332  306  366
14   19  205  305   41  399
15  241   16  299   15   88
16  397  114   96   48  143
17  363   59  360  319  291
18  372  303  201  297  160
19  287  114  153  218  214

In [32]:
a.to_csv('C:\\Users\\ADMIN\\Documents\\Nandhu\\pandas.csv')  #to store data in exel file

In [33]:
d=pd.read_csv('C:\\Users\\ADMIN\\Documents\\Nandhu\\pandas.csv') #to view a storing of data

In [34]:
print(d)

    Unnamed: 0    a    b    c    d    e
0            0  150   83  273  172  198
1            1   52   25  259  390  308
2            2   81   89  123   10  275
3            3  386  291   81  309  254
4            4  369   72  179   10  260
5            5  354  140   51  383  324
6            6   78  305  117   63  251
7            7  304  368  385  239  255
8            8  287   39  332  317   81
9            9  175  165  357  137  357
10          10  227   39  138  237  282
11          11   77  392  368  237   12
12          12  354   57  336  271  248
13          13  139  349  332  306  366
14          14   19  205  305   41  399
15          15  241   16  299   15   88
16          16  397  114   96   48  143
17          17  363   59  360  319  291
18          18  372  303  201  297  160
19          19  287  114  153  218  214

In [50]:

z=d.drop("Unnamed: 0",axis=1)

In [51]:

z.drop("d",axis=1)

      a    b    c    e
0   150   83  273  198
1    52   25  259  308
2    81   89  123  275
3   386  291   81  254
4   369   72  179  260
5   354  140   51  324
6    78  305  117  251
7   304  368  385  255
8   287   39  332   81
9   175  165  357  357
10  227   39  138  282
11   77  392  368   12
12  354   57  336  248
13  139  349  332  366
14   19  205  305  399
15  241   16  299   88
16  397  114   96  143
17  363   59  360  291
18  372  303  201  160
19  287  114  153  214

In [52]:
z.shape

(20, 5)

In [54]:
z.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       20 non-null     int64
 1   b       20 non-null     int64
 2   c       20 non-null     int64
 3   d       20 non-null     int64
 4   e       20 non-null     int64
dtypes: int64(5)
memory usage: 928.0 bytes